{
  "code": 200,
  "message": "Markdown获取成功",
  "data": {
    "url": "https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5",
    "status_code": 200,
    "raw_markdown": null,
    "fit_markdown": "[Accessibility help](https://www.ft.com/accessibility)[Skip to navigation](https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5#site-navigation)[Skip to content](https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5#site-content)[Skip to footer](https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5#site-footer)\n[EU foreign policy](https://www.ft.com/eu-foreign-policy)\nGet instant alerts for this topic[Manage your delivery channels here](https://www.ft.com/myft/alerts)Remove from myFT\n# Europe confronts Trump’s triple threat on Ukraine, Nato and trade\nOfficials fear that the US president will play the big issues off against each other over five weeks of wide-ranging talks\n© FT montage; Reuters/Getty Images\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on x (opens in a new window)](https://twitter.com/intent/tweet?url=https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5&text=Europe%20confronts%20Trump%E2%80%99s%20triple%20threat%20on%20Ukraine%2C%20Nato%20and%20trade&via=ft)\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on facebook (opens in a new window)](https://www.facebook.com/sharer.php?u=https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5&t=Europe%20confronts%20Trump%E2%80%99s%20triple%20threat%20on%20Ukraine%2C%20Nato%20and%20trade)\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on linkedin (opens in a new window)](https://www.linkedin.com/sharing/share-offsite/?url=https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5)\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on whatsapp (opens in a new window)](whatsapp://send?text=Europe%20confronts%20Trump%E2%80%99s%20triple%20threat%20on%20Ukraine%2C%20Nato%20and%20trade%20-%20https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5)\n\n\ncurrent progress 0%\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on x (opens in a new window)](https://twitter.com/intent/tweet?url=https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5&text=Europe%20confronts%20Trump%E2%80%99s%20triple%20threat%20on%20Ukraine%2C%20Nato%20and%20trade&via=ft)\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on facebook (opens in a new window)](https://www.facebook.com/sharer.php?u=https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5&t=Europe%20confronts%20Trump%E2%80%99s%20triple%20threat%20on%20Ukraine%2C%20Nato%20and%20trade)\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on linkedin (opens in a new window)](https://www.linkedin.com/sharing/share-offsite/?url=https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5)\n  * [Europe confronts Trump’s triple threat on Ukraine, Nato and trade on whatsapp (opens in a new window)](whatsapp://send?text=Europe%20confronts%20Trump%E2%80%99s%20triple%20threat%20on%20Ukraine%2C%20Nato%20and%20trade%20-%20https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5)\n\n\n[Henry Foy](https://www.ft.com/henry-foy) in Brussels \nPublished5 hours ago\n[253](https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5#comments-anchor \"Jump to comments section\")Print this page\nUnlock the White House Watch newsletter for free\nYour guide to what Trump’s second term means for Washington, business and the world\nEuropean governments are braced for high-stakes negotiations with US President Donald Trump that will put the continent’s defence, economy and security on the line.\nGrand designs to build “an independent Europe” are on hold as officials strain to maintain Trump’s support through five weeks of crunch talks over Ukraine, transatlantic trade and the US commitment to Nato.\nEurope’s negotiators are increasingly concerned that the US president will demand concessions in one area in exchange for support in another, forcing the EU to sacrifice its core values or accept a firm break with Washington. \n“All these crises, all at once: it’s the perfect storm,” said Josep Borrell, the EU’s former chief diplomat who stepped down in November. “He may try to squeeze us, and could push us in the corner from all three directions.”\n“He could tell us: ‘If you don’t give me a good trade deal, then we will not support Ukraine.’ Or, ‘If you push me to support Ukraine, then we will add to [our requirements for you to increase] your military expenditure for Nato,’ for example.”\nUkrainian troops load shells into a US-made Howitzer: European leaders worry that Trump will cut off US supplies of equipment to the front © Scott Peterson/Getty Images\nSenior EU officials have discussed worst-case scenarios in all three aspects. They include the complete suspension of US support to Ukraine, cutting off intelligence and preventing European countries from providing US-bought weapons; a full-scale trade war with wrenching consequences for economic growth; and the rapid withdrawal from Europe of US troops and military capabilities.\n“This has morphed from best-case scenarios to damage control,” said one senior EU official. “On trade, defence and Ukraine, the choice is between a bad outcome and a very bad outcome.”\nTrump will first square off with European leaders at the G7 summit in Canada in 11 days’ time, where officials expect that the US president will clarify his support for Ukraine and sanctions plan for Russia. European capitals want Trump to pledge ongoing support to Kyiv, but fear he wants a peace deal that would leave Ukraine, and the rest of Europe, vulnerable to future Russian aggression.\nA week later, Nato leaders will gather in The Hague, with European capitals hoping their promises of increased defence spending will convince Trump to maintain US support for European defence and deter him from slashing his deployments of troops and weapons.\nThe following day, EU leaders will huddle for a summit in Brussels knowing they have less than two weeks to negotiate a trade deal with Trump to avoid 50 per cent tariffs that could devastate the continent’s economy.\n“We see [Ukraine, European defence and trade] as separate issues but to Trump, he just sees the same faces presenting him with various annoying questions. He’s not going to treat them differently in different contexts,” said a senior EU diplomat.\n“So we’re essentially one [social media] post or one press conference remark away from calamity on three existential issues for Europe: defence, economy and security,” they added. “And that’s why everyone is so tense.”\nFrom left, France’s Emmanuel Macron, Britain’s Keir Starmer, Donald Trump of the US and Ukraine’s Volodymyr Zelenskyy confer during Pope Francis’s funeral at the Vatican in April © Ukrainian Presidential Press Service/Getty Images\nThat fear of Trump bundling the issues into one negotiation, and using a lack of progress in one area to punish the bloc in another, is Brussels’ most pressing concern, diplomats and officials said.\nMeetings of ambassadors from the EU’s 27 states in recent weeks have been marked by concern about the lack of options available to the bloc, officials briefed on the talks said. Being firm in one area risks backlash in another, they said.\n“[The discussions] are just surreal,” said one of the officials. “The answer to all the big problems we face is: America. And America is supposed to be our closest ally.”\nFrance’s long-standing push for greater European independence from America has gathered many more supporters since Trump’s re-election last November.\n“Our next great era, the next great unifying project, is about building an independent Europe,” European Commission president Ursula von der Leyen said in a speech last week. \nHowever, in private, member state diplomats and EU officials are deeply concerned about how the region’s vulnerabilities may divide countries that support so-called strategic autonomy from those who believe the transatlantic relationship must be defended at all costs.\n“The relationship with the US is fundamental . . . to preserve the strength of the west. Our destinies are intertwined,” Italy’s Prime Minister Giorgia Meloni, perhaps Trump’s closest political ally in Europe, said last week.\nItaly’s Prime Minister Giorgia Meloni is perhaps Donald Trump’s closest political ally in Europe © Riccardo Antimiani/EPA/Shutterstock\n“[The dialogue with Washington] must be carried on with wisdom and common sense, and with a more political than bureaucratic approach,” Meloni said.\nAlexandra de Hoop Scheffer, president of the German Marshall Fund, said European capitals now took a “much more realistic” approach to the transatlantic relationship.\nBut she added: “What are our shared interests? We have never really had that conversation . . . The offer, the proposition, will have to come from Brussels and to that extent they are still not prepared.”\nTrump’s shifting positions have made it even more complex to co-ordinate responses among the 27 member states on the three issues.\nSigns that Trump is growing impatient with Russia’s Vladimir Putin have raised hopes that he could even support more sanctions on Moscow. He has praised efforts by Nato partners to increase spending but also threatened troop withdrawals from Europe. And his multiple flip-flops on tariff threats have left many wondering how seriously he should be taken.\n“We cannot allow ourselves to . . . once again fall for the fallacy that the storm will pass,” von der Leyen said in her speech last week. “That things will go back to how they were before: if only the war would end, or a tariff deal be struck, or the next elections have a different outcome. No, they will not.”\nWhile a long-term goal of a more autonomous Europe may be spreading among European capitals, the short-term answer of how to keep the US onside while the continent develops its alternative future is proving difficult.\n“Are we in trouble?” a senior EU official involved in the discussions said. “Yes. We’re in trouble.”\n _Additional reporting by Guiliana Ricozzi in Rome._\n[Reuse this content (opens in new window)](https://enterprise.ft.com/en-gb/services/republishing/republish-content-request?ft-content-uuid=e33583b5-6808-45f8-ac63-2f132d1dead5)[ CommentsJump to comments section](https://www.ft.com/content/e33583b5-6808-45f8-ac63-2f132d1dead5#comments-anchor \"Jump to comments section\")\n##  Follow the topics in this article \n  * [ EU defence ](https://www.ft.com/eu-defence)\n  * [ War in Ukraine ](https://www.ft.com/war-in-ukraine)\n  * [ US foreign policy ](https://www.ft.com/us-foreign-policy)\n  * [ EU foreign policy ](https://www.ft.com/eu-foreign-policy)\n\n\n## Promoted Content\n## Latest on EU foreign policy\n  * [Martin Sandbu](https://www.ft.com/martin-sandbu)\n[It’s in Europe’s interest to put sanctions on Israel](https://www.ft.com/content/8a82a52f-c02b-452b-b7df-ba3bcf94c1e0)\n  * [EU foreign policy](https://www.ft.com/eu-foreign-policy)\n[EU industry chief pushes ‘buy European’ in response to Trump ](https://www.ft.com/content/cd3b82a6-49dd-431e-98aa-91ce46d2aa2c)\n  * [Europe Express](https://www.ft.com/europe-express)\n[Why the post-Brexit ‘reset’ faces a reality check at EU-UK summit](https://www.ft.com/content/72616fc8-e050-427c-a80b-b3646192ac59) Premium content\n  * [The Big Read](https://www.ft.com/the-big-read)\n[Flatter or confront? How world leaders are dealing with Trump](https://www.ft.com/content/c7a267a8-a66c-4fe3-aca8-e22422edc034)\n  * [EU defence](https://www.ft.com/eu-defence)\n[Macron open to stationing French nuclear weapons in other European nations ](https://www.ft.com/content/96231d9c-ee48-43b3-9c82-bdc4002b41a5)\n  * [Europe Express](https://www.ft.com/europe-express)\n[Why the EU is racing to expand its Russia sanctions in a push for peace](https://www.ft.com/content/2a781235-ad89-4aaf-a55f-c4863ba060c1) Premium content\n  * [Marc De Vos](https://www.ft.com/stream/38cd70c2-8f23-447c-a5fc-58def9ceea0a)\n[The EU needs a new geopolitical compass](https://www.ft.com/content/913e42a6-37a3-4aad-bcd9-311db0fc7bc4)\n  * [Europe Express](https://www.ft.com/europe-express)\n[EU backs Ukraine war crimes tribunal in riposte to Putin’s war parade](https://www.ft.com/content/cb419871-07af-495d-ab23-09e4ba0d8ad1) Premium content\n\n\n##  Follow the topics in this article \n  * [ EU defence ](https://www.ft.com/eu-defence)\n  * [ War in Ukraine ](https://www.ft.com/war-in-ukraine)\n  * [ US foreign policy ](https://www.ft.com/us-foreign-policy)\n  * [ EU foreign policy ](https://www.ft.com/eu-foreign-policy)\n\n\n## Comments\nClose side navigation menu\n[Subscribe for full access](https://www.ft.com/products?segmentId=4526c036-7527-ab37-9a29-0b0403fa0b5f)\n  *[FT]: Financial Times\n",
    "title": "Europe confronts Trump’s triple threat on Ukraine, Nato and trade",
    "word_count": 1529
  },
  "success": true
}
